{"CaptionBB": [438, 734, 772, 778], "Width": 850, "Mention": ["The maximum ensemble size E is the parameter that con-\ntrols how many models out of the available pool contribute\nto the final prediction. While in theory we should com-\nbine the advice of all available experts, in practice it may\nbe useful to ignore some of the lower-weighted experts for\nthe purpose of prediction but still keep them in the pool in\ncase they redeem themselves. For instance, in cases where\nat any given time there are only a few experts that have\nan accurate model of the system, it may be useful to com-\nbine the advice of these top E without the majority of the\nexperts that would weigh down the performance. Figure 6\nshows the performance of the online ranking system during\nthe summer of 2005, using different values for the predicting\nensemble size E.\nFinally, we have experimented with the learning rate β of\nthe ranking algorithm. Figure 7 shows the performances ob-\ntained for different settings of this parameter. Theoretically,\nthe learning rate should affect the performance by control-\nling the fraction by which weights are reduced. However,\nour experiments show that varying the learning rate has a\nminor impact to the overall performance change. To under-\nstand why this is the case, we examine the weights of the top\nsoring models for each setting of β. We plot the weights of\nthe top E experts per day as a stacked bar, where the total\ny-value corresponds to the fraction of the weights of models\nin the budget B that are also in the predicting ensemble E.\nEach color uniquely identifies a particular model so we can\nobserve which models are dominant and how long they stay\nin the ensemble. Figure 8 shows the weight distribution for\nlearning rate setting β = 0.1 and Figure 9 shows the weight\ndistribution for β = 0.9. The weight contribution of the two\nmost dominant ensemble models in both plots explains the\n"], "ImageBB": [466, 511, 746, 719], "ImageText": [], "Number": 7, "GoldLabelsTagged": true, "Height": 1100, "Caption": "Figure 7: OnlineRank daily performance with vary- ing learning rate (β) - Winter 2006 (1/1/2006- 3/31/2006) ", "Type": "Figure", "Page": 6, "DPI": 100}