{"Caption": "Figure 20: Scalability of select non-graphics applications and kernels: Larrabee’s general-purpose many-core architecture delivers performance scalability for various non-graphics visual and throughput computing workloads and common HPC kernels. ", "CaptionBB": [73, 293, 408, 348], "Mention": ["Image and Video Processing: The Larrabee architecture is \nsuitable for many traditional 2D image and video analysis \napplications. Native implementations of traditional 2D filtering \nfunctions (both linear and non-linear) as well as more advanced \nfunctions, like video cast indexing, sports video analysis, human \nbody tracking, and foreground estimation offer significant \nscalability as shown in Figure 20. Biomedical imaging represents \nan important subset of this processing type. Medical imaging \nneeds such as back-projection, volume rendering, automated \nsegmentation, and robust deformable registration, are related yet \ndifferent from those of consumer imaging and graphics. Figure 20 \nalso includes scalability analysis of iso-surface extraction on a 3D \nvolume dataset using the marching cubes algorithm. \n", "Physical Simulation: Physical simulation applications use \nnumerical simulation to model complex natural phenomena in \nmovies and games, such as fire effects, waterfalls in virtual \nworlds, and collisions between rigid or deformable objects. Large \ndata-sets, unstructured control-flow and data accesses often make \nthese applications more challenging to scale than traditional \nstreaming applications. Looking beyond interactive game physics, \nwe also analyzed applicability of Larrabee architecture for the \nbroader class of entertainment physics including offline movie-\nindustry effects and distributed real-time virtual-world simulation. \nSpecific simulation results based on Stanford’s PhysBAM are \nshown in Figure 20 and illustrate very good scalability for \nproduction fluid, production cloth, and production face. \nImplementation and scalability analysis details are described by \nHughes et al. [2007]. \n", "Larrabee is also highly scalable for non-visual throughput \napplications, as shown in Figure 20. Larrabee’s highly-threaded \nx86 architecture benefits traditional enterprise throughput \ncomputing applications, such as text indexing. Its threading, \ntogether with its wide-SIMD IEEE-compliant double-precision \nsupport, makes it well positioned for financial analytics, such as \nportfolio management. Internal research projects have proven \nLarrabee architecture scalability for many traditional high \nperformance computing (HPC) workloads and well-known HPC \nkernels such as 3D-FFT and BLAS3 (with dataset larger than on-\ndie cache). More details are described by Chen et al. [2008]. \n"], "ImageBB": [92, 51, 427, 285], "ImageText": [], "Number": 20, "GoldLabelsTagged": true, "Height": 1100, "Width": 850, "SomethingWrong": true, "Type": "Figure", "Page": 13, "DPI": 100}