{"CaptionBB": [437, 608, 766, 660], "Width": 850, "Mention": ["In Fig. 10, we can see Wofs has stable performance in \ndata insertion and data truncation as usual, no matter how big \nthe file we access is. In comparison, in Fig. 10, we can see \nthe bigger file we insert and truncate, the more time needed \nfor doing insertion and truncation in ext3. It shows the \nadvantage of supporting data insertion and data truncation. In \nFig. 10, we can see the time needed for doing insertion and \ntruncation in Wofs is a little more than the time needed in \next3 when the file size is 1MB. This is because the object \nsize in Wofs is equal to 1MB, and the file which is 1MB in \nsize only has 1 object. So inserting or truncating a file in \nWofs is totally the same as inserting or truncating a file in \next3 except that Wofs needs to do communication inside \nitself to do 1 file access but ext3 doesn’t need that. Except \nthat special case, Wofs has better performance than ext3 in \ndata insertion and data truncation ignoring the time needed \nfor network communication. \n", "In Section IV.B, we can see Wofs has stable and good \nperformance in data insertion and data truncation with \nvariable file sizes. Now we compare Wofs with ext3 to \nevaluate the advantage of supporting data insertion and data \ntruncation. We choose to compare Wofs with ext3 because \next3 is the most popular file system in Linux and OSD \nservers use it as their base file system to store object data. \nFig. 10 shows the results of this comparison. The so-called \n“Insert”, “Trunc 1” and “Trunc 2” in Fig. 10 are just the \naccess models shown in Fig. 7. Besides, because Wofs is a \ndistributed network file system and ext3 is a local file \nsystem, to compare them fairly, we eliminate the time \nneeded for delivering data or parameters in the network to \ntest the time required for doing insertion and truncation in \nWofs. \n"], "ImageBB": [435, 383, 779, 607], "ImageText": [], "Number": 10, "GoldLabelsTagged": true, "Height": 1100, "Caption": "Figure 10. The time needed for doing 1 insertion and 1 truncation on Wofs        with different file sizes ignoring the time needed for network communication, and the time needed for doing 1 insertion and 1 truncation                       on ext3 with different file sizes. ", "SomethingWrong": true, "Type": "Figure", "Page": 6, "DPI": 100}